In [35]:
import pandas as pd
df=pd.read_csv('stocks.csv',na_values=["not available","n.a.",-1])
df

   tickers   eps  revenue  price  people
0   google  27.0       87    845   larry
1      wtm   4.0      484     65     NaN
2  walmart   NaN       85     64    bill
3      ril   NaN       50   1023  mukesh

In [36]:
df.to_csv("new.csv",index=False)

In [37]:
def convert_people_cell(cell):
    if(cell=="n.a."):
        return 'sam walton'
    return cell
stocks=pd.read_excel("new stocks.xlsx","Sheet1",converters={
    'people': convert_people_cell
})
df

   tickers   eps  revenue  price  people
0   google  27.0       87    845   larry
1      wtm   4.0      484     65     NaN
2  walmart   NaN       85     64    bill
3      ril   NaN       50   1023  mukesh